//C$SERV$M JOB (EMC),'COMPILE C$SERV$M - C',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID,REGION=0M,MSGLEVEL=(1,1)
//MAIN JCLLIB ORDER=(CBC.SCCNPRC,CEE.SCEEPROC)
//* JOBLIST.C
//COMPS    EXEC EDCXCB,
//   INFILE='USRHLQ.SRC.C(JOBLIST)',
//   CPARM='OPTFILE(DD:CCOPTS)',
//   BPARM='LET,ALIASES(ALL),CALL(NO)',
//   OUTFILE='USRHLQ.OBJ(JOBLIST),DISP=SHR'
//COMPILE.CCOPTS   DD DISP=SHR,DSN=USRHLQ.CCOPTS(MAIN)
//* SERVMAIN.C
//COMPS    EXEC EDCXCB,
//   INFILE='USRHLQ.SRC.C(SERVMAIN)',
//   CPARM='OPTFILE(DD:CCOPTS)',
//   BPARM='LET,ALIASES(ALL),CALL(NO)',
//   OUTFILE='USRHLQ.OBJ(SERVMAIN),DISP=SHR'
//COMPILE.CCOPTS   DD DISP=SHR,DSN=USRHLQ.CCOPTS(MAIN)
//* SERVMAIN
//BIND1    EXEC CEEXL,
//   INFILE='USRHLQ.OBJ(SERVMAIN)',
//   OUTFILE='USRHLQ.LINKLIB,DISP=SHR'
//INPGM    DD DSNAME=USRHLQ.OBJ,DISP=SHR
//TMPPGM   DD DSNAME=CEE.SCEELKED,DISP=SHR
//SYSIN DD *
  INCLUDE TMPPGM(CEETGTFN)
  INCLUDE TMPPGM(CEETLOR)
  INCLUDE TMPPGM(TIME)
  INCLUDE INPGM(JOBLIST)
  SETCODE AC(1)
  NAME SERVMAIN(R)
/*
