//R$SERV$M JOB (EMC),'RUN SERVMAIN - C',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID,REGION=0M,MSGLEVEL=(1,1)
//* AUTHORIZE LIBRARIES
// SETPROG APF,ADD,DSN=USRHLQ.LINKLIB,SMS
//* START SERVMAIN
//SERVSTRT EXEC PGM=IKJEFT01,PARM='SERVMAIN USRHLQ.TEST.JCL'
//STEPLIB  DD   DISP=SHR,DSN=USRHLQ.LINKLIB
//SYSPRINT DD   SYSOUT=*
//SERVLOG  DD   SYSOUT=*
//SYSTSPRT DD   SYSOUT=*
//SYSTSIN  DD   DUMMY
//SYSIN    DD   DISP=SHR,DSN=USRHLQ.PARMLIB(RUN1)
